---
kind: method
id: M:Autodesk.Revit.DB.XYZ.Normalize
zh: 点
source: html/6228ceb8-100b-daf8-78cf-0b7f514a1338.htm
---
# Autodesk.Revit.DB.XYZ.Normalize Method

**中文**: 点

Returns a new XYZ whose coordinates are the normalized values from this vector.

## Syntax (C#)
```csharp
public XYZ Normalize()
```

## Returns
The normalized XYZ or zero if the vector is almost Zero.

## Remarks
Normalized indicates that the length of this vector equals one (a unit vector).